Revit 2027 API
AnalysisDisplayLegendSettings.ShowDataName Property
 If true, data name is shown in the legend.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowDataName { get; set; }
Public Property ShowDataName As Boolean
	Get
	Set
public:
property bool ShowDataName {
	bool get ();
	void set (bool value);
}
member ShowDataName : bool with get, set
Property Value
Boolean
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace